# Agenda

1. Pandas in general
2. Series
    - Creating 
    - Retrieving from them
    - Methods
    - Working with `nan`
    - Broadcasting
    - Indexes
3. Data frames
    - Creating
    - Retrieving from them
    - Applying methods across all columns
4. Reading data from files
    - CSV
    - (Excel, a little)
    - JSON
    - Retrieving from the network

# Pandas data structures

There are two main data structures you need to know about with Pandas:

- `Series` -- basically a 1D NumPy array
- `DataFrame` -- basically a 2D NumPy array

The rows of a data frame are going to be equivalent to the rows of a NumPy array.

The columns of a data frame are all going to be Series objects.

# Installing pandas

You can install it along with many other Python packages with `pip` (command-line program, not to be run inside of Python or Jupyter):

    python3 -m pip install -U pandas
    
Once it is installed, then we'll want to load it into our program.

In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
# let's create a Pandas Series

s = Series([10, 20, 30, 40, 50, 60, 70])

In [4]:
type(s)

pandas.core.series.Series

In [5]:
s

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

In [6]:
# I can do many of the same things with a series that I did with NumPy arrays

s[0]

10

In [7]:
s[3]

40

In [8]:
s.sum()

280

In [9]:
s.mean()

40.0

In [10]:
s = Series([10, 20, 30, 40, 50, 60, 70], dtype=np.float64)

In [11]:
s

0    10.0
1    20.0
2    30.0
3    40.0
4    50.0
5    60.0
6    70.0
dtype: float64

In [12]:
# behind the scenes, we can find a NumPy array
s.values

array([10., 20., 30., 40., 50., 60., 70.])

In [13]:
# I can create a Pandas Series  based on a 1D NumPy array

np.random.seed(0)
s = Series(np.random.randint(0, 100, 10))

s

0    44
1    47
2    64
3    67
4    67
5     9
6    83
7    21
8    36
9    87
dtype: int64

In [14]:
s.min()

9

In [15]:
s.max()

87

In [16]:
s.mean()

52.5

In [17]:
s.std()

25.67424130654432

In [18]:
s.sum()

525

In [20]:
s.count()   # how many non-nan values are there in this series?

10

In [21]:
# can I create a boolean series, and use it as a mask index? YES!

s < 30

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
8    False
9    False
dtype: bool

In [22]:
s[s<30]  # notice that when I filter the elements of s, the items I get back retain their original indexes

5     9
7    21
dtype: int64

In [23]:
s[s<s.mean()]  # retrieve values less than the mean

0    44
1    47
5     9
7    21
8    36
dtype: int64

# Ways to retrieve from a series

1. We've now seen that we can retrieve from a series using `[]`, just as we did with NumPy arrays.  But I'd like you to break this habit, ASAP.  (When we get to data frames, this will make more sense, and you won't regret it.)

2. We can also retrieve from a series using the `.loc` accessor and `[]`.  This lets us retrieve via the index.

3. We can also retrieve from a series using the `iloc` accessor and `[]`.  This lets us retrieve via the position in the series, regardless of the index, starting at 0.

In [24]:
a = s[s<s.mean()]

In [25]:
a   # this is a series containing 5 elements.

0    44
1    47
5     9
7    21
8    36
dtype: int64

In [26]:
# I can retrieve via the index using just [].  Again: Probably not a good idea, but it will work!
a[5]

9

In [27]:
a[8]

36

In [28]:
a[0]

44

In [29]:
a[[1, 7]]   # fancy indexing works here, too!

1    47
7    21
dtype: int64

In [30]:
# Better than [] alone is retrieving with .loc, which lets us specify the index

a.loc[5]

9

In [31]:
a.loc[8]

36

In [32]:
a.loc[0]

44

In [33]:
a.loc[[1,7]]

1    47
7    21
dtype: int64

In [36]:
# Another way to retrieve is with .iloc, where we specify the numeric position in the series,
# starting with 0.

a.iloc[3]

21

In [37]:
a

0    44
1    47
5     9
7    21
8    36
dtype: int64

In [38]:
a.loc[7]    # same as a.iloc[3]

21

In [39]:
a.iloc[2]

9

In [40]:
a.loc[2]

KeyError: 2

In [41]:
a

0    44
1    47
5     9
7    21
8    36
dtype: int64

In [43]:
# is there a way for me to set the index when I create a series?
# yes!

s = Series([10, 20, 30, 40, 50],
          index=[2,4,6,8,10])      # index and values must be of the same length!

In [44]:
s

2     10
4     20
6     30
8     40
10    50
dtype: int64

In [45]:
s.loc[4]  # this retrieves the item whose index is 4

20

In [46]:
s.iloc[4]  # this retrieves the item whose position is 4

50

In [47]:
s = Series([10, 20, 30, 40, 50],
          index=list('abcde'))    # indexes can be strings, including 1-character strings!

s

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [48]:
s.loc['d']

40

In [49]:
s.iloc[3]

40

In [51]:
# we can retrieve multiple values with fancy indexing
# we'll get a series back as a result (assuming that there's more than one value there)

s.loc[['b', 'd']] # fancy indexing with strings

b    20
d    40
dtype: int64

In [52]:
# I can even use a slice!

s.loc['b':'d']   # in general, Python slices are [start:end+1] -- but not in Pandas, where slices are INCLUSIVE

b    20
c    30
d    40
dtype: int64

# Exercises: Series

1. Create a series containing 10 random integers from 0-100, with index `a` - `j`.
2. Retrieve the item at index `b`.
3. Retrieve the items at indexes `c`, `d`, and `f`.
4. What is the mean of the items at indexes `a`, `e`, `g`, and `h`?
5. What is the sum of the even values?
6. What is the sum of the items whose positions (`.iloc`) are even?

In [56]:
np.random.seed(0)
s = Series(np.random.randint(0, 100, 10),
          index=list('abcdefghij'))
s

a    44
b    47
c    64
d    67
e    67
f     9
g    83
h    21
i    36
j    87
dtype: int64

In [58]:
# retrieve the item at index b

s.loc['b']

47

In [59]:
# Retrieve the items at indexes c, d, and f.

s.loc[['c', 'd', 'f']]   # fancy indexing -- pass a list of indexes to .loc[]

c    64
d    67
f     9
dtype: int64

In [60]:
# Retrieve the items at indexes c, d, and e

s.loc['c':'e']  # one set of square brackets here

c    64
d    67
e    67
dtype: int64

In [63]:
# What is the mean of the items at indexes a, e, g, and h?

s.loc[['a', 'e', 'g', 'h']].mean()

53.75

In [66]:
# What is the sum of the even values?

s.loc[s%2==0].sum()

144

In [67]:
# What is the sum of the items whose positions (.iloc) are even?

s.iloc[[0,2,4,6,8]]

a    44
c    64
e    67
g    83
i    36
dtype: int64

In [69]:
s.iloc[range(0, 10, 2)]   # from 0, up to (not including) 10, skipping by 2

a    44
c    64
e    67
g    83
i    36
dtype: int64

In [70]:
s.iloc[range(0, 10, 2)].sum()

294

# How is Pandas different from NumPy?

In [71]:
np.random.seed(0)
s1 = Series(np.random.randint(0, 100, 10), 
           index=list('abcdefghij'))
s2 = Series(np.random.randint(0, 100, 10), 
           index=list('defghijklm'))

In [72]:
s1

a    44
b    47
c    64
d    67
e    67
f     9
g    83
h    21
i    36
j    87
dtype: int64

In [73]:
s2

d    70
e    88
f    88
g    12
h    58
i    65
j    39
k    87
l    46
m    88
dtype: int64

In [74]:
s1 + s1  # add it to itself

a     88
b     94
c    128
d    134
e    134
f     18
g    166
h     42
i     72
j    174
dtype: int64

In [75]:
s1 + s2  # what happens here?

a      NaN
b      NaN
c      NaN
d    137.0
e    155.0
f     97.0
g     95.0
h     79.0
i    101.0
j    126.0
k      NaN
l      NaN
m      NaN
dtype: float64

In [76]:
s3 = Series([10, 20, 30, 40], index=list('abcd'))

s1 + s3

a     54.0
b     67.0
c     94.0
d    107.0
e      NaN
f      NaN
g      NaN
h      NaN
i      NaN
j      NaN
dtype: float64

In [77]:
# how can I get around this, if I want to?

s1 + s2   # this is translated in Python to s1.__add__(s2).  In Pandas, that becomes s1.add(s2)

a      NaN
b      NaN
c      NaN
d    137.0
e    155.0
f     97.0
g     95.0
h     79.0
i    101.0
j    126.0
k      NaN
l      NaN
m      NaN
dtype: float64

In [78]:
s1.add(s2)

a      NaN
b      NaN
c      NaN
d    137.0
e    155.0
f     97.0
g     95.0
h     79.0
i    101.0
j    126.0
k      NaN
l      NaN
m      NaN
dtype: float64

In [79]:
# we can pass a value to the "fill_value" keyword argument in s1.add, telling it what
# value to use if the index isn't matched on the other side.

s1.add(s2, fill_value=0)

a     44.0
b     47.0
c     64.0
d    137.0
e    155.0
f     97.0
g     95.0
h     79.0
i    101.0
j    126.0
k     87.0
l     46.0
m     88.0
dtype: float64

# Exercises: Indexing and series

1. Create two series, each with 10 random integers from 0-100.  The first should have an index of a-j. The second should have an index of b-k.
2. Add them together, but first predicting which indexes will give you `nan` results.
3. Add them together, with 0 being a fill value.  Can you use a different fill value?
4. Multiply them together, with 1 being a fill value. 
5. Sum all of the even numbers together from both of the series.

In [80]:
np.random.seed(0)

s1 = Series(np.random.randint(0, 100, 10), 
           index=list('abcdefghij'))

s2 = Series(np.random.randint(0, 100, 10), 
           index=list('bcdefghijk'))

In [81]:
s1

a    44
b    47
c    64
d    67
e    67
f     9
g    83
h    21
i    36
j    87
dtype: int64

In [82]:
s2

b    70
c    88
d    88
e    12
f    58
g    65
h    39
i    87
j    46
k    88
dtype: int64

In [83]:
# Add them together, but first predicting which indexes will give you nan results.

# we should get nan for a (only in s1) and k (only in s2)

s1 + s2

a      NaN
b    117.0
c    152.0
d    155.0
e     79.0
f     67.0
g    148.0
h     60.0
i    123.0
j    133.0
k      NaN
dtype: float64

In [84]:
# Add them together, with 0 being a fill value.  Can you use a different fill value?

s1.add(s2, fill_value=0)  # now, if any index doesn't have a match in the other series, we'll use 0

a     44.0
b    117.0
c    152.0
d    155.0
e     79.0
f     67.0
g    148.0
h     60.0
i    123.0
j    133.0
k     88.0
dtype: float64

In [85]:
s1.add(s2, fill_value=123.456)

a    167.456
b    117.000
c    152.000
d    155.000
e     79.000
f     67.000
g    148.000
h     60.000
i    123.000
j    133.000
k    211.456
dtype: float64

In [88]:
# Multiply them together, with 1 being a fill value. 

s1.mul(s2, fill_value=1)

a      44.0
b    3290.0
c    5632.0
d    5896.0
e     804.0
f     522.0
g    5395.0
h     819.0
i    3132.0
j    4002.0
k      88.0
dtype: float64

In [93]:
# Sum all of the even numbers together from both of the series.

s1[s1%2==0]   # all even items in s1

a    44
c    64
i    36
dtype: int64

In [94]:
s2[s2%2==0]  # all even items in s2

b    70
c    88
d    88
e    12
f    58
j    46
k    88
dtype: int64

In [96]:
s1[s1%2==0].add(s2[s2%2==0], fill_value=0).sum()

594.0

# Next up

1. `nan` in Pandas (removing, filling)
2. dtypes and assignment
3. Aggregate methods and convenience methods
4. Sorting by value

Resume at :25

In [97]:
s = Series([10, 20, 30, 40, 50])
s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [98]:
a = np.array([10, 20, 30, 40, 50])
a

array([10, 20, 30, 40, 50])

In [99]:
a[2] = np.nan

ValueError: cannot convert float NaN to integer

In [100]:
s.loc[2] = np.nan

In [101]:
s

0    10.0
1    20.0
2     NaN
3    40.0
4    50.0
dtype: float64

In [102]:
a = np.array([10, 20, np.nan, 40, 50])
a

array([10., 20., nan, 40., 50.])

In [103]:
a.mean()

nan

In [104]:
s.mean()    # what happens when we ask for the mean of our nan-containing series?

30.0

# Pandas and `nan`

In Pandas, much of the behavior around `nan` is the opposite of what we've seen in NumPy:

- Assigning `nan` (or any float value) to a series with an integer dtype will result in the dtype changing to accommodate our data, including `nan`.
- Invoking an aggregate method, such as `mean` or `std` on a series containing `np.nan` will *ignore* the `np.nan` value(s) when making its calculation.

In [107]:
# what if you really want the nan values, and want them to mess up your calculation?
s.mean(skipna=False)

nan

In [111]:
s.mean()   # implicitly, skipna=True

30.0

In [112]:
s.dropna().mean()

30.0

In [108]:
s

0    10.0
1    20.0
2     NaN
3    40.0
4    50.0
dtype: float64

In [109]:
# if I want to get rid of the nan values, I can use "dropna"

s.dropna()  # we get a new series back, without any nan values

0    10.0
1    20.0
3    40.0
4    50.0
dtype: float64

In [110]:
s  # s is totally unchanged -- dropna returns a new series, not touching/changing the original one

0    10.0
1    20.0
2     NaN
3    40.0
4    50.0
dtype: float64

In [113]:
# fillna replaces all nan values with another value -- it returns a new series
s

0    10.0
1    20.0
2     NaN
3    40.0
4    50.0
dtype: float64

In [114]:
s.fillna(999)

0     10.0
1     20.0
2    999.0
3     40.0
4     50.0
dtype: float64

In [115]:
s.fillna(s.mean())

0    10.0
1    20.0
2    30.0
3    40.0
4    50.0
dtype: float64

# dtypes are similar to NumPy

In [125]:
s = Series([10, 20, 30, 40, 50], dtype=np.float16)

In [126]:
s

0    10.0
1    20.0
2    30.0
3    40.0
4    50.0
dtype: float16

In [127]:
# how can I now turn my series into a dtype of np.int64?
# you cannot set it - -but you can use "astype", just like with NumPy

In [128]:
s.astype(np.int64)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [129]:
s = s.astype(np.int64)

In [130]:
s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [131]:
s.loc[3] = 12.34

In [132]:
s

0    10.00
1    20.00
2    30.00
3    12.34
4    50.00
dtype: float64

# Exercises with dtypes and `nan`

1. Create a series containing 10 random *floats* from 0-1,000.
2. Replace those numbers whose integer part is even with `nan`.
3. Replace those `nan` values with the mean of the remaining numbers.

In [134]:
np.random.seed(0)
s = Series(np.random.rand(10) * 1000)
s

0    548.813504
1    715.189366
2    602.763376
3    544.883183
4    423.654799
5    645.894113
6    437.587211
7    891.773001
8    963.662761
9    383.441519
dtype: float64

In [139]:
# let's try to find the even numbers here

s.loc[s.astype(np.int64)%2==0] = np.nan

In [140]:
s

0           NaN
1    715.189366
2           NaN
3           NaN
4    423.654799
5    645.894113
6    437.587211
7    891.773001
8    963.662761
9    383.441519
dtype: float64

In [142]:
s.fillna(s.mean())

0    637.314681
1    715.189366
2    637.314681
3    637.314681
4    423.654799
5    645.894113
6    437.587211
7    891.773001
8    963.662761
9    383.441519
dtype: float64

In [143]:
# actually assign the new series back to s
s = s.fillna(s.mean())

In [144]:
s

0    637.314681
1    715.189366
2    637.314681
3    637.314681
4    423.654799
5    645.894113
6    437.587211
7    891.773001
8    963.662761
9    383.441519
dtype: float64

In [145]:
s

0    637.314681
1    715.189366
2    637.314681
3    637.314681
4    423.654799
5    645.894113
6    437.587211
7    891.773001
8    963.662761
9    383.441519
dtype: float64

In [146]:
s = Series(np.random.randint(0, 100, 50))
s

0     39
1     87
2     46
3     88
4     81
5     37
6     25
7     77
8     72
9      9
10    20
11    80
12    69
13    79
14    47
15    64
16    82
17    99
18    88
19    49
20    29
21    19
22    19
23    14
24    39
25    32
26    65
27     9
28    57
29    32
30    31
31    74
32    23
33    35
34    75
35    55
36    28
37    34
38     0
39     0
40    36
41    53
42     5
43    38
44    17
45    79
46     4
47    42
48    58
49    31
dtype: int64

In [147]:
# descriptive statistics
s.min()

0

In [148]:
s.max()

99

In [149]:
s.mean()

45.42

In [150]:
s.std()

27.180492704759224

In [151]:
s.quantile(0.25)   # 25% mark

25.75

In [152]:
s.quantile(0.5)    # 50% mark, aka median

39.0

In [153]:
s.quantile(0.75)

71.25

In [154]:
# having all of these descriptive statistics for our series would be really great
# fortunately, Pandas provides us with such a method, namely .describe

s.describe()

count    50.000000
mean     45.420000
std      27.180493
min       0.000000
25%      25.750000
50%      39.000000
75%      71.250000
max      99.000000
dtype: float64

In [155]:
# another useful method is .head, which shows the first part of a series
s.head()

0    39
1    87
2    46
3    88
4    81
dtype: int64

In [156]:
s.head(3)

0    39
1    87
2    46
dtype: int64

In [157]:
# similarly, we have tail
s.tail()

45    79
46     4
47    42
48    58
49    31
dtype: int64

In [158]:
s.tail(3)

47    42
48    58
49    31
dtype: int64

In [159]:
# how often does each value appear?
s.value_counts()

39    2
9     2
31    2
19    2
79    2
0     2
32    2
88    2
55    1
42    1
74    1
23    1
35    1
75    1
38    1
5     1
4     1
34    1
57    1
36    1
17    1
53    1
28    1
14    1
65    1
87    1
46    1
81    1
37    1
25    1
77    1
72    1
20    1
80    1
69    1
47    1
64    1
82    1
99    1
49    1
29    1
58    1
dtype: int64

In [160]:
s = Series([10, 20, 30, 10, 10, 30, np.nan])

In [161]:
s.value_counts()

10.0    3
30.0    2
20.0    1
dtype: int64

In [163]:
s.value_counts(dropna=False)

10.0    3
30.0    2
20.0    1
NaN     1
dtype: int64

# Exercises: Weather forecast

1. Create a series in which the values are the forecast high temperatures in the next 10-12 days.  The index should be a list of strings containing the dates in 'MMDD' format.
2. What 2 temperatures occur the greatest number of times?
3. Get descriptive statistics for the weather forecast.

In [165]:
s = Series([30, 31, 33, 34, 34, 30, 28, 29, 28, 29, 29, 31, 31, 32],
          index='0607 0608 0609 0610 0611 0612 0613 0614 0615 0616 0617 0618 0619 0620'.split())

In [166]:
s

0607    30
0608    31
0609    33
0610    34
0611    34
0612    30
0613    28
0614    29
0615    28
0616    29
0617    29
0618    31
0619    31
0620    32
dtype: int64

In [167]:
s.value_counts()

31    3
29    3
30    2
34    2
28    2
33    1
32    1
dtype: int64

In [168]:
s.value_counts().head(2)

31    3
29    3
dtype: int64

In [169]:
s.describe()

count    14.000000
mean     30.642857
std       2.023217
min      28.000000
25%      29.000000
50%      30.500000
75%      31.750000
max      34.000000
dtype: float64

# Sorting

Yesterday, we saw that we can sort a NumPy array using `np.sort`.

In Pandas, we actually have two different ways to sort a series:

- Sort by values
- Sort by the index

In [171]:
s.sort_values()  # returns a new series, with the old series' index and values, sorted ascending

0613    28
0615    28
0614    29
0616    29
0617    29
0607    30
0612    30
0608    31
0618    31
0619    31
0620    32
0609    33
0610    34
0611    34
dtype: int64

In [172]:
s.sort_values(ascending=False)

0610    34
0611    34
0609    33
0620    32
0608    31
0618    31
0619    31
0607    30
0612    30
0614    29
0616    29
0617    29
0613    28
0615    28
dtype: int64

In [174]:
# What are the three highest temperatures we'll see?
s.sort_values(ascending=False).head(3)

0610    34
0611    34
0609    33
dtype: int64

In [175]:
# let's sort by the index, instead

s.sort_index()

0607    30
0608    31
0609    33
0610    34
0611    34
0612    30
0613    28
0614    29
0615    28
0616    29
0617    29
0618    31
0619    31
0620    32
dtype: int64

In [176]:
s.sort_index(ascending=False)

0620    32
0619    31
0618    31
0617    29
0616    29
0615    28
0614    29
0613    28
0612    30
0611    34
0610    34
0609    33
0608    31
0607    30
dtype: int64

In [177]:
help(s.sort_values)

Help on method sort_values in module pandas.core.series:

sort_values(axis=0, ascending: 'bool | int | Sequence[bool | int]' = True, inplace: 'bool' = False, kind: 'str' = 'quicksort', na_position: 'str' = 'last', ignore_index: 'bool' = False, key: 'ValueKeyFunc' = None) method of pandas.core.series.Series instance
    Sort by the values.

    Sort a Series in ascending or descending order by some
    criterion.

    Parameters
    ----------
    axis : {0 or 'index'}, default 0
        Axis to direct sorting. The value 'index' is accepted for
        compatibility with DataFrame.sort_values.
    ascending : bool or list of bools, default True
        If True, sort values in ascending order, otherwise descending.
    inplace : bool, default False
        If True, perform operation in-place.
    kind : {'quicksort', 'mergesort', 'heapsort', 'stable'}, default 'quicksort'
        Choice of sorting algorithm. See also :func:`numpy.sort` for more
        information. 'mergesort' and 'stable' are the only stable  algorithms.
    na_position : {'first' or 'last'}, default 'last'
        Argument 'first' puts NaNs at the beginning, 'last' puts NaNs at
        the end.
    ignore_index : bool, default False
        If True, the resulting axis will be labeled 0, 1, , n - 1.

        .. versionadded:: 1.0.0

    key : callable, optional
        If not None, apply the key function to the series values
        before sorting. This is similar to the `key` argument in the
        builtin :meth:`sorted` function, with the notable difference that
        this `key` function should be *vectorized*. It should expect a
        ``Series`` and return an array-like.

        .. versionadded:: 1.1.0

    Returns
    -------
    Series or None
        Series ordered by values or None if ``inplace=True``.

    See Also
    --------
    Series.sort_index : Sort by the Series indices.
    DataFrame.sort_values : Sort DataFrame by the values along either axis.
    DataFrame.sort_index : Sort DataFrame by indices.

    Examples
    --------
    >>> s = pd.Series([np.nan, 1, 3, 10, 5])
    >>> s
    0     NaN
    1     1.0
    2     3.0
    3     10.0
    4     5.0
    dtype: float64

    Sort values ascending order (default behaviour)

    >>> s.sort_values(ascending=True)
    1     1.0
    2     3.0
    4     5.0
    3    10.0
    0     NaN
    dtype: float64

    Sort values descending order

    >>> s.sort_values(ascending=False)
    3    10.0
    4     5.0
    2     3.0
    1     1.0
    0     NaN
    dtype: float64

    Sort values inplace

    >>> s.sort_values(ascending=False, inplace=True)
    >>> s
    3    10.0
    4     5.0
    2     3.0
    1     1.0
    0     NaN
    dtype: float64

    Sort values putting NAs first

    >>> s.sort_values(na_position='first')
    0     NaN
    1     1.0
    2     3.0
    4     5.0
    3    10.0
    dtype: float64

    Sort a series of strings

    >>> s = pd.Series(['z', 'b', 'd', 'a', 'c'])
    >>> s
    0    z
    1    b
    2    d
    3    a
    4    c
    dtype: object

    >>> s.sort_values()
    3    a
    1    b
    4    c
    2    d
    0    z
    dtype: object

    Sort using a key function. Your `key` function will be
    given the ``Series`` of values and should return an array-like.

    >>> s = pd.Series(['a', 'B', 'c', 'D', 'e'])
    >>> s.sort_values()
    1    B
    3    D
    0    a
    2    c
    4    e
    dtype: object
    >>> s.sort_values(key=lambda x: x.str.lower())
    0    a
    1    B
    2    c
    3    D
    4    e
    dtype: object

    NumPy ufuncs work well here. For example, we can
    sort by the ``sin`` of the value

    >>> s = pd.Series([-4, -2, 0, 2, 4])
    >>> s.sort_values(key=np.sin)
    1   -2
    4    4
    2    0
    0   -4
    3    2
    dtype: int64

    More complicated user-defined functions can be used,
    as long as they expect a Series and return an array-like

    >>> s.sort_values(key=lambda x: (np.tan(x.cumsum())))
    0   -4
    3    2
    4    4
    1   -2
    2    0
    dtype: int64

# Strings

Python offers powerful strings, and NumPy arrays can contain strings.

In [178]:
a = np.array('this is a test'.split())

In [179]:
a

array(['this', 'is', 'a', 'test'], dtype='<U4')

In [180]:
a[0] = 'pqrstuv'

In [181]:
a

array(['pqrs', 'is', 'a', 'test'], dtype='<U4')

In [184]:
s = Series('this is a test'.split())  # dtype will be "object", meaning: Python objects

In [185]:
s

0    this
1      is
2       a
3    test
dtype: object

In [186]:
# how many characters are in each word?


len(s)

4

# Working with strings in Pandas

A Pandas series has an `.str` attribute, which is used to access string functionality. This functionality includes all of the methods provided by the Python `str` class, plus a bunch of other convenience methods that you might want to use. 

So *never* use a `for` loop on your Pandas series.  Instead, find the appropriate method via `.str`, and apply it on the series.

In [187]:
s.str.len()   # this means: run len() on each element of s, and return a series with its results

0    4
1    2
2    1
3    4
dtype: int64

In [188]:
# another method: contains

s.str.contains('a')  # sort of like the "in" operator -- does the argument string appear in each element of s?

0    False
1    False
2     True
3    False
dtype: bool

In [189]:
s.str.contains('e')

0    False
1    False
2    False
3     True
dtype: bool

In [190]:
# contains can actually look for a regular expression

s.str.contains('[ae]')  # does it contain either a or e?

0    False
1    False
2     True
3     True
dtype: bool

In [191]:
s.str.isdigit()  # can I turn each of these elements into an integer?

0    False
1    False
2    False
3    False
dtype: bool

In [192]:
s = Series('ab 12 cd 34'.split())
s

0    ab
1    12
2    cd
3    34
dtype: object

In [193]:
s.astype(np.int64)  # let's convert our series to a bunch of integers

ValueError: invalid literal for int() with base 10: 'ab'

In [197]:
# let's find all of the int-able (digits-only) strings, retrieve them,
# and then turn them into integers

s.loc[s.str.isdigit()].astype(np.int64).sum()

46

In [198]:
# what happens if we sum the elements in s?
s.sum()

'ab12cd34'

# Exercises: Strings and series

1. Create a series containing 10 words of different lengths.
2. Find the words whose lengths are odd.
3. Find the words whose lengths are greater than the mean word length (i.e., longer than average).
4. Find words that contain the letter 't'.

In [199]:
s = Series('this is a fantastic example of brilliant writing for my course'.split())

In [200]:
s

0          this
1            is
2             a
3     fantastic
4       example
5            of
6     brilliant
7       writing
8           for
9            my
10       course
dtype: object

In [201]:
s.values

array(['this', 'is', 'a', 'fantastic', 'example', 'of', 'brilliant',
       'writing', 'for', 'my', 'course'], dtype=object)

In [202]:
s.str.len()

0     4
1     2
2     1
3     9
4     7
5     2
6     9
7     7
8     3
9     2
10    6
dtype: int64

In [204]:
# get a boolean series in which True says, "This element has an odd length"

s.str.len() % 2 == 1

0     False
1     False
2      True
3      True
4      True
5     False
6      True
7      True
8      True
9     False
10    False
dtype: bool

In [205]:
# apply that boolean series to s.loc, and thus get only those words with odd lengths from s
s.loc[s.str.len() % 2 == 1]

2            a
3    fantastic
4      example
6    brilliant
7      writing
8          for
dtype: object

In [207]:
# get the mean word length
s.str.len().mean()

4.7272727272727275

In [208]:
# get a boolean series based on this, for words longer than the mean length 
s.str.len() > s.str.len().mean()

0     False
1     False
2     False
3      True
4      True
5     False
6      True
7      True
8     False
9     False
10     True
dtype: bool

In [209]:
# use this boolean series as a mask index to get only those words in s that are longer than the mean
s.loc[s.str.len() > s.str.len().mean()]

3     fantastic
4       example
6     brilliant
7       writing
10       course
dtype: object

In [211]:
# find words that contain the letter 't'

s.loc[s.str.contains('t')]

0         this
3    fantastic
6    brilliant
7      writing
dtype: object

In [212]:
s = Series('123 456 789'.split())
s

0    123
1    456
2    789
dtype: object

In [213]:
s.mean()

41152263.0

In [214]:
# what is the mean? It's the sum / the length

s.sum()

'123456789'

In [215]:
123456789 / 3

41152263.0

# Next up

1. Data frames
    - Creating them
    - Retrieving from them
    - Applying the methods we've learned for series on data frames
2. Loading and storing data in different formats    

Resume at 1:10 p.m. Eastern

# Data frames

A data frame is a 2D data structure. It has column and rows.

The more important thing to understand is that each column is a Pandas series.  Each column has a dtype.

We can create data frames in a few different ways:

- List of lists (or list of series, or a 2D NumPy array)
- List of dicts
- Dict of lists

In [216]:
# 3 rows and 4 columns as a list of lists

df = DataFrame([[10, 20, 30, 40],
                [50, 60, 70, 80], 
               [90, 100, 110, 120]])

In [217]:
df

    0    1    2    3
0  10   20   30   40
1  50   60   70   80
2  90  100  110  120

In [218]:
# the rows are the index, just like before with series, and can be set in the same way (index=...)
# the columns are set in the same way, but with columns=...

df = DataFrame([[10, 20, 30, 40],
                [50, 60, 70, 80], 
               [90, 100, 110, 120]],
              index=list('xyz'),
              columns=list('abcd'))

In [219]:
df

    a    b    c    d
x  10   20   30   40
y  50   60   70   80
z  90  100  110  120

In [220]:
df.index

Index(['x', 'y', 'z'], dtype='object')

In [221]:
df.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

# Retrieving from a data frame

In a data frame, we can use `[]` to retrieve the *columns*.

We can retrieve the rows with our old friends `.loc` and `.iloc` using the index and the numeric position.

In [222]:
df['a']  # this means: retrieve column a

x    10
y    50
z    90
Name: a, dtype: int64

In [223]:
# multiple columns via fancy indexing

df[['a', 'b']]

    a    b
x  10   20
y  50   60
z  90  100

In [224]:
# how do I retrieve rows? Mainly via .loc

df.loc['x']    # when you retrieve a row, you get a (temporary) series based on the items in that row

a    10
b    20
c    30
d    40
Name: x, dtype: int64

In [225]:
# fancy indexing with .loc

df.loc[['x', 'z']]

    a    b    c    d
x  10   20   30   40
z  90  100  110  120

In [228]:
# what if I want to retrieve a particular item in a row and a column?

df['c']['x']     # row 'x', column 'c'

30

# Don't retrieve in this way!

If you have multiple sets of square brackets, you're asking for trouble!

1. It'll take more time, because every `[]` is a method call
2. It'll take more memory, because it has to load the temporary data
3. There will likely be an interim, temporary series created behind the scenes, which if you try to assign to it, will give you trouble.

Rule of thumb is: Don't use square brackets after square brackets.

In [229]:
# how should I do it?

df.loc['x', 'c']     # .loc takes two arguments -- a row selector and a column selector

30

In [230]:
df.loc[['x', 'y'], 'c']

x    30
y    70
Name: c, dtype: int64

In [231]:
df.loc[['x', 'y'], ['a', 'c']]

    a   c
x  10  30
y  50  70

In [232]:
df

    a    b    c    d
x  10   20   30   40
y  50   60   70   80
z  90  100  110  120

In [233]:
df['a'] > 40    # this will compare every element in df['a'] with 40, and return True/False

x    False
y     True
z     True
Name: a, dtype: bool

In [234]:
df.loc[ df['a']>40   ]   # retrieve all rows from df where 'a' > 40

    a    b    c    d
y  50   60   70   80
z  90  100  110  120

In [235]:
#       row selector    column selector
df.loc[ df['a']>40,      ['a', 'c']   ]

    a    c
y  50   70
z  90  110

# Exercises: Retrieving from data frames

1. Create a 6x6 data frame with rows 'uvwxyz' and columns 'abcdef'.  The values should be random integers from 0-1,000.  (Remember that you can use a 2D NumPy array to seed a data frame.)
2. Retrieve column `b`.
3. Retrieve row `v`.
4. Retrieve columns `b` and `d`.
5. Retrieve rows `u` and `y`.
6. Retrieve the item at row `x`, and column `d`.
7. Retrieve the items at rows `y` and `z`, and columns `a` and `c`.

In [237]:
np.random.seed(0)

df = DataFrame(np.random.randint(0, 1000, [6,6]),
              index=list('uvwxyz'),
              columns=list('abcdef'))
df

     a    b    c    d    e    f
u  684  559  629  192  835  763
v  707  359    9  723  277  754
w  804  599   70  472  600  396
x  314  705  486  551   87  174
y  600  849  677  537  845   72
z  777  916  115  976  755  709

In [238]:
# retrieve column b

df['b']

u    559
v    359
w    599
x    705
y    849
z    916
Name: b, dtype: int64

In [239]:
# another syntax for retrieving columns -- dot syntax

df.b

u    559
v    359
w    599
x    705
y    849
z    916
Name: b, dtype: int64

In [240]:
# retrieve row v

df.loc['v']

a    707
b    359
c      9
d    723
e    277
f    754
Name: v, dtype: int64

In [241]:
# retrieve columns 'b' and 'd'

df[['b', 'd']]   # fancy indexing to rescue!

     b    d
u  559  192
v  359  723
w  599  472
x  705  551
y  849  537
z  916  976

In [242]:
# retrieve rows 'u' and 'y'
df.loc[['u', 'y']]

     a    b    c    d    e    f
u  684  559  629  192  835  763
y  600  849  677  537  845   72

In [243]:
# retrieve the item at row 'x', column 'd'

#     rows   columns
df.loc['x', 'd']

551

In [244]:
# retrieve rows y and z, columns a and c
df.loc[['y', 'z'],  ['a', 'c']]

     a    c
y  600  677
z  777  115

In [245]:
df

     a    b    c    d    e    f
u  684  559  629  192  835  763
v  707  359    9  723  277  754
w  804  599   70  472  600  396
x  314  705  486  551   87  174
y  600  849  677  537  845   72
z  777  916  115  976  755  709

In [246]:
# I want to change a value in the data frame!
# I can do this by assigning, using .loc[rows, columns]

df.loc['x', 'b'] = 999
df

     a    b    c    d    e    f
u  684  559  629  192  835  763
v  707  359    9  723  277  754
w  804  599   70  472  600  396
x  314  999  486  551   87  174
y  600  849  677  537  845   72
z  777  916  115  976  755  709

In [247]:
df.loc['x', 'b'] = 123.456   # what if I set it to be a float?
df

     a        b    c    d    e    f
u  684  559.000  629  192  835  763
v  707  359.000    9  723  277  754
w  804  599.000   70  472  600  396
x  314  123.456  486  551   87  174
y  600  849.000  677  537  845   72
z  777  916.000  115  976  755  709

In [249]:
# how do we know which column has which type?
df.dtypes

a      int64
b    float64
c      int64
d      int64
e      int64
f      int64
dtype: object

In [250]:
# we now have seen that column b is float64.  What happens when I retrieve the row v?

df.loc['v']

a    707.0
b    359.0
c      9.0
d    723.0
e    277.0
f    754.0
Name: v, dtype: float64

In [251]:
# assigning a single/scalar value to a number of locations will broadcast the assignment
df.loc[['v', 'y'], ['b', 'd', 'f']] = 8888

In [252]:
df

     a         b    c     d    e     f
u  684   559.000  629   192  835   763
v  707  8888.000    9  8888  277  8888
w  804   599.000   70   472  600   396
x  314   123.456  486   551   87   174
y  600  8888.000  677  8888  845  8888
z  777   916.000  115   976  755   709

# Exercises: Assigning and retrieving in data frames

1. Create a 4x6 data frame with rows 'wxyz' and columns 'abcdef', and values being random integers from 0-1,000.
2. Find all elements of the column 'a' that are even.
3. Use this boolean array (where 'a' is even) as a mask index on .loc, for columns 'b' and 'd'.
4. Find all elements of the column 'd' that are >= d's mean.
5. Assign the number 234 to all rows where d >= its mean, and columns 'a' and 'f'.

In [253]:
np.random.seed(0)

df = DataFrame(np.random.randint(0, 1000, [4,6]),
              index=list('wxyz'),
              columns=list('abcdef'))
df

     a    b    c    d    e    f
w  684  559  629  192  835  763
x  707  359    9  723  277  754
y  804  599   70  472  600  396
z  314  705  486  551   87  174

In [255]:
df['a'][df['a'] % 2 == 0]

w    684
y    804
z    314
Name: a, dtype: int64

In [256]:
#       rows          columns
df.loc[df['a']%2==0, ['b', 'd'] ]

     b    d
w  559  192
y  599  472
z  705  551

In [259]:
#            row selector          column selector
df.loc[df['d'] >= df['d'].mean(),    'd' ]

x    723
z    551
Name: d, dtype: int64

In [260]:
#            row selector          column selector
df.loc[df['d'] >= df['d'].mean(),    ['a', 'f'] ]

     a    f
x  707  754
z  314  174

# Next up

1. Series methods on a data frame
2. Add/remove rows/columns to a data frame
3. Real-world data! CSV
    - Read data into our data frame
    - Start to ask questions about real-world data using row/column selectors
    
Resume at :35

In [261]:
df

     a    b    c    d    e    f
w  684  559  629  192  835  763
x  707  359    9  723  277  754
y  804  599   70  472  600  396
z  314  705  486  551   87  174

In [262]:
# general rule of thumb: Any series method can be run on a data frame, too
# you'll get a result for each column on the data frame
# your result will typically be a series (in which the index is the df's columns)
#   or a new data frame, based on the one you have

In [263]:
df['a'].mean()  # gets the mean of column a

627.25

In [264]:
df.mean()   # gets the mean of every column

a    627.25
b    555.50
c    298.50
d    484.50
e    449.75
f    521.75
dtype: float64

In [265]:
df.std()

a    215.210556
b    144.760722
c    305.728093
d    221.372236
e    332.877730
f    288.030525
dtype: float64

In [266]:
df.describe()  # now, we'll get descriptive statistics for every column

                a           b           c           d          e           f
count    4.000000    4.000000    4.000000    4.000000    4.00000    4.000000
mean   627.250000  555.500000  298.500000  484.500000  449.75000  521.750000
std    215.210556  144.760722  305.728093  221.372236  332.87773  288.030525
min    314.000000  359.000000    9.000000  192.000000   87.00000  174.000000
25%    591.500000  509.000000   54.750000  402.000000  229.50000  340.500000
50%    695.500000  579.000000  278.000000  511.500000  438.50000  575.000000
75%    731.250000  625.500000  521.750000  594.000000  658.75000  756.250000
max    804.000000  705.000000  629.000000  723.000000  835.00000  763.000000

In [267]:
df

     a    b    c    d    e    f
w  684  559  629  192  835  763
x  707  359    9  723  277  754
y  804  599   70  472  600  396
z  314  705  486  551   87  174

In [268]:
df.loc['y', 'd'] = np.nan
df.loc['y', 'f'] = np.nan
df.loc['x', 'b'] = np.nan
df.loc['w', 'a'] = np.nan

In [269]:
df

       a      b    c      d    e      f
w    NaN  559.0  629  192.0  835  763.0
x  707.0    NaN    9  723.0  277  754.0
y  804.0  599.0   70    NaN  600    NaN
z  314.0  705.0  486  551.0   87  174.0

In [270]:
# remove all rows containing nan with df.dropna
# in a data frame, dropna removes any row containing any np.nan values!
df.dropna()

       a      b    c      d   e      f
z  314.0  705.0  486  551.0  87  174.0

In [272]:
# what if we want to be a bit looser, and so longer as we have 4 good pieces of
# data, we'll keep a row?

df.dropna(thresh=5)

       a      b    c      d    e      f
w    NaN  559.0  629  192.0  835  763.0
x  707.0    NaN    9  723.0  277  754.0
z  314.0  705.0  486  551.0   87  174.0

In [273]:
df

       a      b    c      d    e      f
w    NaN  559.0  629  192.0  835  763.0
x  707.0    NaN    9  723.0  277  754.0
y  804.0  599.0   70    NaN  600    NaN
z  314.0  705.0  486  551.0   87  174.0

In [275]:
# how can I add a row to a data frame? Just assign to it, using .loc and naming the index
df.loc['q'] = [10, 20, 30, 40, 50, 60]
df

       a      b    c      d    e      f
w    NaN  559.0  629  192.0  835  763.0
x  707.0    NaN    9  723.0  277  754.0
y  804.0  599.0   70    NaN  600    NaN
z  314.0  705.0  486  551.0   87  174.0
q   10.0   20.0   30   40.0   50   60.0

In [276]:
df.loc['r'] = [100, 200, 300, 400, 500, 600]
df

       a      b    c      d    e      f
w    NaN  559.0  629  192.0  835  763.0
x  707.0    NaN    9  723.0  277  754.0
y  804.0  599.0   70    NaN  600    NaN
z  314.0  705.0  486  551.0   87  174.0
q   10.0   20.0   30   40.0   50   60.0
r  100.0  200.0  300  400.0  500  600.0

In [277]:
# how do I add a column? Assign to a new column with []
df['g'] = [10, 20, 30, 40, 50, 60]
df

       a      b    c      d    e      f   g
w    NaN  559.0  629  192.0  835  763.0  10
x  707.0    NaN    9  723.0  277  754.0  20
y  804.0  599.0   70    NaN  600    NaN  30
z  314.0  705.0  486  551.0   87  174.0  40
q   10.0   20.0   30   40.0   50   60.0  50
r  100.0  200.0  300  400.0  500  600.0  60

In [278]:
# how do I remove a row?

df.drop('r')   # we get back a new data frame, without 'r', but df hasn't changed!

       a      b    c      d    e      f   g
w    NaN  559.0  629  192.0  835  763.0  10
x  707.0    NaN    9  723.0  277  754.0  20
y  804.0  599.0   70    NaN  600    NaN  30
z  314.0  705.0  486  551.0   87  174.0  40
q   10.0   20.0   30   40.0   50   60.0  50

In [280]:
df = df.drop(['q', 'r'])   # assign to df the result of removing 'q' and 'r' from df
df

       a      b    c      d    e      f   g
w    NaN  559.0  629  192.0  835  763.0  10
x  707.0    NaN    9  723.0  277  754.0  20
y  804.0  599.0   70    NaN  600    NaN  30
z  314.0  705.0  486  551.0   87  174.0  40

In [281]:
# to remove a column, we can still use "drop"
# but we need to specify that we're removing a column -- otherwise, the default is a row

df.drop('g', axis='columns')  # this returns a new data frame, doesn't affect df

       a      b    c      d    e      f
w    NaN  559.0  629  192.0  835  763.0
x  707.0    NaN    9  723.0  277  754.0
y  804.0  599.0   70    NaN  600    NaN
z  314.0  705.0  486  551.0   87  174.0

In [282]:
df = df.drop(['f', 'g'], axis='columns')
df

       a      b    c      d    e
w    NaN  559.0  629  192.0  835
x  707.0    NaN    9  723.0  277
y  804.0  599.0   70    NaN  600
z  314.0  705.0  486  551.0   87

In [283]:
help(df.drop)

Help on method drop in module pandas.core.frame:

drop(labels=None, axis: 'Axis' = 0, index=None, columns=None, level: 'Level | None' = None, inplace: 'bool' = False, errors: 'str' = 'raise') method of pandas.core.frame.DataFrame instance
    Drop specified labels from rows or columns.

    Remove rows or columns by specifying label names and corresponding
    axis, or by specifying directly index or column names. When using a
    multi-index, labels on different levels can be removed by specifying
    the level. See the `user guide <advanced.shown_levels>`
    for more information about the now unused levels.

    Parameters
    ----------
    labels : single label or list-like
        Index or column labels to drop. A tuple will be used as a single
        label and not treated as a list-like.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Whether to drop labels from the index (0 or 'index') or
        columns (1 or 'columns').
    index : single label or list-like
        Alternative to specifying axis (``labels, axis=0``
        is equivalent to ``index=labels``).
    columns : single label or list-like
        Alternative to specifying axis (``labels, axis=1``
        is equivalent to ``columns=labels``).
    level : int or level name, optional
        For MultiIndex, level from which the labels will be removed.
    inplace : bool, default False
        If False, return a copy. Otherwise, do operation
        inplace and return None.
    errors : {'ignore', 'raise'}, default 'raise'
        If 'ignore', suppress error and only existing labels are
        dropped.

    Returns
    -------
    DataFrame or None
        DataFrame without the removed index or column labels or
        None if ``inplace=True``.

    Raises
    ------
    KeyError
        If any of the labels is not found in the selected axis.

    See Also
    --------
    DataFrame.loc : Label-location based indexer for selection by label.
    DataFrame.dropna : Return DataFrame with labels on given axis omitted
        where (all or any) data are missing.
    DataFrame.drop_duplicates : Return DataFrame with duplicate rows
        removed, optionally only considering certain columns.
    Series.drop : Return Series with specified index labels removed.

    Examples
    --------
    >>> df = pd.DataFrame(np.arange(12).reshape(3, 4),
    ...                   columns=['A', 'B', 'C', 'D'])
    >>> df
       A  B   C   D
    0  0  1   2   3
    1  4  5   6   7
    2  8  9  10  11

    Drop columns

    >>> df.drop(['B', 'C'], axis=1)
       A   D
    0  0   3
    1  4   7
    2  8  11

    >>> df.drop(columns=['B', 'C'])
       A   D
    0  0   3
    1  4   7
    2  8  11

    Drop a row by index

    >>> df.drop([0, 1])
       A  B   C   D
    2  8  9  10  11

    Drop columns and/or rows of MultiIndex DataFrame

    >>> midx = pd.MultiIndex(levels=[['lama', 'cow', 'falcon'],
    ...                              ['speed', 'weight', 'length']],
    ...                      codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2],
    ...                             [0, 1, 2, 0, 1, 2, 0, 1, 2]])
    >>> df = pd.DataFrame(index=midx, columns=['big', 'small'],
    ...                   data=[[45, 30], [200, 100], [1.5, 1], [30, 20],
    ...                         [250, 150], [1.5, 0.8], [320, 250],
    ...                         [1, 0.8], [0.3, 0.2]])
    >>> df
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
            length  1.5     1.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
            length  1.5     0.8
    falcon  speed   320.0   250.0
            weight  1.0     0.8
            length  0.3     0.2

    Drop a specific index combination from the MultiIndex
    DataFrame, i.e., drop the combination ``'falcon'`` and
    ``'weight'``, which deletes only the corresponding row

    >>> df.drop(index=('falcon', 'weight'))
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
            length  1.5     1.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
            length  1.5     0.8
    falcon  speed   320.0   250.0
            length  0.3     0.2

    >>> df.drop(index='cow', columns='small')
                    big
    lama    speed   45.0
            weight  200.0
            length  1.5
    falcon  speed   320.0
            weight  1.0
            length  0.3

    >>> df.drop(index='length', level=1)
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
    falcon  speed   320.0   250.0
            weight  1.0     0.8

# Reading real-world data files

Most data in the data-science world is exchanged in either (a) CSV or (b) Excel.  A growing amount is also in JSON, but it's still in third place.

Pandas can easily read in CSV data.

In [284]:
!ls

Cisco-2022-06June-06-analytics.html   Cisco-2022-06June-06.zip
Cisco-2022-06June-06-analytics.ipynb  Cisco-2022-06June-07-analytics.ipynb

In [285]:
!wget https://files.lerner.co.il/data-science-exercise-files.zip

--2022-06-07 21:49:08--  https://files.lerner.co.il/data-science-exercise-files.zip
Resolving files.lerner.co.il (files.lerner.co.il)... 138.197.26.202
Connecting to files.lerner.co.il (files.lerner.co.il)|138.197.26.202|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 1561985 (1.5M) [application/zip]
Saving to: data-science-exercise-files.zip

data-science-exerci 100%[===================>]   1.49M  46.1KB/s    in 26s

2022-06-07 21:49:35 (57.9 KB/s) - data-science-exercise-files.zip saved [1561985/1561985]

In [286]:
!unzip data-science-exercise-files.zip

Archive:  data-science-exercise-files.zip
 extracting: airports.zip
  inflating: taxi.csv
  inflating: burrito_current.csv
   creating: airports/
  inflating: titanic3.csv
  inflating: celebrity_deaths_2016.csv
  inflating: languages.csv
  inflating: airlines.dat

In [287]:
# how can I read a CSV file into Pandas?
# answer: I use the pd.read_csv method, which takes a filename 

df = pd.read_csv('taxi.csv')

In [288]:
df

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954430,40.764141,1,N,-73.974754,40.754093,2,17.0,0.0,0.5,0.00,0.0,0.3,17.80
1,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,-73.971443,40.758942,1,N,-73.978539,40.761909,1,6.5,0.0,0.5,1.00,0.0,0.3,8.30
2,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,-73.978111,40.738434,1,N,-73.990273,40.745438,1,8.0,0.0,0.5,2.20,0.0,0.3,11.00
3,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892,40.773529,1,N,-73.971527,40.760330,1,13.5,0.0,0.5,2.86,0.0,0.3,17.16
4,1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979088,40.776772,1,N,-73.982162,40.758999,2,9.5,0.0,0.5,0.00,0.0,0.3,10.30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9994,1,2015-06-01 00:12:59,2015-06-01 00:24:18,1,2.70,-73.947792,40.814972,1,N,-73.973358,40.783638,2,11.0,0.5,0.5,0.00,0.0,0.3,12.30
9995,1,2015-06-01 00:12:59,2015-06-01 00:28:16,1,4.50,-74.004066,40.747818,1,N,-73.953758,40.779285,1,16.0,0.5,0.5,3.00,0.0,0.3,20.30
9996,2,2015-06-01 00:13:00,2015-06-01 00:37:25,1,5.59,-73.994377,40.766102,1,N,-73.903206,40.750546,2,21.0,0.5,0.5,0.00,0.0,0.3,22.30
9997,2,2015-06-01 00:13:02,2015-06-01 00:19:10,6,1.54,-73.978302,40.748531,1,N,-73.989166,40.762852,2,6.5,0.5,0.5,0.00,0.0,0.3,7.80
9998,1,2015-06-01 00:13:04,2015-06-01 00:36:33,1,5.80,-73.983215,40.726414,1,N,-73.924133,40.701645,1,21.0,0.5,0.5,4.45,0.0,0.3,26.75

In [289]:
df.shape

(9999, 19)

In [290]:
df.dtypes

VendorID                   int64
tpep_pickup_datetime      object
tpep_dropoff_datetime     object
passenger_count            int64
trip_distance            float64
pickup_longitude         float64
pickup_latitude          float64
RateCodeID                 int64
store_and_fwd_flag        object
dropoff_longitude        float64
dropoff_latitude         float64
payment_type               int64
fare_amount              float64
extra                    float64
mta_tax                  float64
tip_amount               float64
tolls_amount             float64
improvement_surcharge    float64
total_amount             float64
dtype: object

In [291]:
# load only a few columns: trip_distance, passenger_count, total_amount

df = pd.read_csv('taxi.csv',
                usecols=['trip_distance', 'passenger_count', 'total_amount'])
df.head()

   passenger_count  trip_distance  total_amount
0                1           1.63         17.80
1                1           0.46          8.30
2                1           0.87         11.00
3                1           2.13         17.16
4                1           1.40         10.30